Foundation-Devices/passport2/ports/stm32/boards/Passport/common/gpio.c
// SPDX-FileCopyrightText: © 2020 Foundation Devices, Inc. <hello@foundationdevices.com>
// SPDX-License-Identifier: GPL-3.0-or-later
//

#include "stm32h7xx_hal.h"

void gpio_init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, 1);

    /* Configure the MRESET line */
    GPIO_InitStruct.Pin   = GPIO_PIN_1;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 0);

#ifdef SCREEN_MODE_COLOR
    /* Configure the PWR_SHDN line */
    GPIO_InitStruct.Pin   = GPIO_PIN_14;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
#else
    /* Configure the PWR_SHDN line */
    GPIO_InitStruct.Pin   = GPIO_PIN_2;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
#endif
}

__attribute__((noreturn)) void passport_reset(void) {
    NVIC_SystemReset();
}

__attribute__((noreturn)) void passport_shutdown(void) {
#ifdef SCREEN_MODE_COLOR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14, 1);
#else
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, 1);
#endif  // SCREEN_MODE_COLOR

    while (1) {
        __NOP();
    }
}
